doc/soap-ui-teste-esb.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:chec="http://localhost:8081/checkout" xmlns:mod="http://model.fiapesb.dsaouda.github.com">
   <soapenv:Header/>
   <soapenv:Body>
      <chec:comprar>
         
         <chec:arg0>
         
            <mod:cliente>
                              
               <mod:login>adm@fiap.com.br</mod:login>
               <mod:senha>123</mod:senha>
            </mod:cliente>
            
            <mod:endereco>
                              
               <mod:cep>01538-001</mod:cep>
            </mod:endereco>
            
            <mod:produto>
               
               <mod:id>129359532</mod:id>
               
            </mod:produto>
            
         </chec:arg0>
      </chec:comprar>
   </soapenv:Body>
</soapenv:Envelope>